{
  "filename": "user_manual.md",
  "__html": "<h1>1. User login</h1>\n<p>Requires the user to enter the account name and password of the system.</p>\n<p><img src=\"img/image-1624433272455.png\" alt=\"\"></p>\n<h1>2. Data access</h1>\n<p>The data access module displays a list of all tasks connected to the system within the current user authority, and can\nview, edit, update and delete the details of these tasks.</p>\n<p>Click [Data Access], there are two steps to fill in data access information: business information, data stream.</p>\n<p><img src=\"img/image-1624431177918.png\" alt=\"\"></p>\n<h2>2.1 Business Information</h2>\n<h3>2.1.1 Business Information</h3>\n<p>You are required to fill in basic business information for access tasks.</p>\n<p><img src=\"img/image-1624431271642.png\" alt=\"\"></p>\n<ul>\n<li>Business English ID: Unified lowercase English name, please try to include the product name and concise\nspecifications, such as pay_base</li>\n<li>Business Chinese name: Chinese description of the business, easy to use and retrieve, up to 128 characters</li>\n<li>Business responsible person: at least 2 people, the business responsible person can view and modify business\ninformation, add and modify all access configuration items</li>\n<li>Business introduction: Cut SMS to introduce the business background and application of this access task:</li>\n</ul>\n<h3>2.1.2 Access requirements</h3>\n<p>Access requirements require users to choose message middleware: high throughput (TUBE):</p>\n<p><img src=\"img/image-1624431306077.png\" alt=\"\"></p>\n<p>High-throughput-Tube: high-throughput message transmission component, suitable for log message transmission.</p>\n<h3>2.1.3 Access scale</h3>\n<p>The scale of access requires users to judge the scale of access data in advance, to allocate computing and storage\nresources later.</p>\n<p><img src=\"img/image-1624431333949.png\" alt=\"\"></p>\n<h2>2.2 Data stream</h2>\n<p>Click [Next] to enter the data flow information filling step. There are four modules for data flow information filling:\nbasic information, data source, data information, and data stream.</p>\n<p>In the data flow process, you can click [New Data Stream] to create a new data stream page:</p>\n<p><img src=\"img/image-1624431416449.png\" alt=\"\"></p>\n<h3>2.2.1 Basic information</h3>\n<p>You are required to fill in the basic information of the data stream in the access task:</p>\n<p><img src=\"img/image-1624431435574.png\" alt=\"\"></p>\n<ul>\n<li>Data stream ID: The prefix is automatically generated according to the product/project, the unique identifier of the\ndata in the business, the unique identifier defined by a certain business, the data stream ID in the data source, and\nthe entry in the Hive information table The data stream ID is the same</li>\n<li>Data stream name: interface information description, the length is limited to varchar (64), 32 Chinese</li>\n<li>Data stream owner: The data stream owner can view and modify data stream information, add and modify all access\nconfiguration items</li>\n<li>Introduction to data flow: simple text introduction to data flow</li>\n</ul>\n<h3>2.2.2 Data source</h3>\n<p>You are required to select the source of the data stream.</p>\n<p>Currently, three methods of file and independent push are supported, and the detailed information of the data source can\nbe supplemented in the advanced options.</p>\n<ul>\n<li>File: The business data is in the file, and the business machine deploys InLong Agent, which is read according to\ncustomized policy rules</li>\n<li>Autonomous push: Push data to the messaging middleware through the SDK</li>\n</ul>\n<p><img src=\"img/image-1624431594406.png\" alt=\"\"></p>\n<h3>2.2.3 Data Information</h3>\n<p>You are required to fill in the data-related information in the data stream.</p>\n<p><img src=\"img/image-1624431617259.png\" alt=\"\"></p>\n<ul>\n<li>Data Format</li>\n<li>Data encoding: If the data source contains Chinese, you need choose UTF-8 or GBK, otherwise the encoding format is\nincorrect and garbled characters after storage</li>\n<li>Source field separator: the format of data sent to MQ</li>\n<li>Source data field: attributes with different meanings divided by a certain format in MQ</li>\n</ul>\n<h3>2.2.4 Data storage</h3>\n<p>You are required to select the final flow direction of this task, this part is not currently supports both hive storage\nand autonomous push.</p>\n<p><img src=\"img/image-1624431713360.png\" alt=\"\"></p>\n<p>Add HIVE storage:</p>\n<p><img src=\"img/image-1624431787323.png\" alt=\"\"></p>\n<ul>\n<li>Target database: hive database name (prepared to create in advance)</li>\n<li>Target table: hive table name</li>\n<li>First-level partition: the field name of the first-level subdirectory of hdfs data divided by hive data</li>\n<li>Secondary partition: the field name of the first-level subdirectory of hdfs data divided by hive data</li>\n<li>Username: hive server connection account name</li>\n<li>User password: hive server connection account password</li>\n<li>HDFS url: Hive bottom HDFS connection</li>\n<li>JDBC url: jdbc url of hive server</li>\n<li>Field related information: source field name, source field type, HIVE field name, HIVE field type, field description,\nand support deletion and addition-</li>\n</ul>\n<h1>3. Access details</h1>\n<h2>3.1 Execution log</h2>\n<p>When the status of the data access task is &quot;approved successfully&quot; or &quot;configuration failed&quot;, the &quot;execution log&quot;\nfunction can be used to allow users to view the progress and details of the task.</p>\n<p><img src=\"img/image-1624432002615.png\" alt=\"\"></p>\n<p>Click [Execution Log] to display the details of the task execution log in a pop-up window.</p>\n<p><img src=\"img/image-1624432022859.png\" alt=\"\"></p>\n<p>The execution log will display the task type, execution result, execution log content, end time, and the end time of the\nexecution of the access process. If the execution fails, you can &quot;restart&quot; the task and execute it again.</p>\n<h2>3.2 Task details</h2>\n<p>The business person in charge/following person can view the access details of the task, and can modify and update part\nof the information under the status of [Waiting Applying], [Configuration Successful], and [Configuration Failed].</p>\n<p>There are three modules in the access task details: business information, data stream and data storage.</p>\n<h3>3.2.1 Business Information</h3>\n<p>Display the basic business information in the access task, click [Edit] to modify part of the content</p>\n<p><img src=\"img/image-1624432076857.png\" alt=\"\"></p>\n<h3>3.2.2 Data stream</h3>\n<p>Display the basic information of the data flow under the access task, click [New Data Flow] to create a new data flow\ninformation</p>\n<p><img src=\"img/image-1624432092795.png\" alt=\"\"></p>\n<h3>3.2.3 Data Storage</h3>\n<p>Display the basic information of the data flow in the access task, select different flow types through the drop-down\nbox, and click [New Flow Configuration] to create a new data storage.</p>\n<p><img src=\"img/image-1624432114765.png\" alt=\"\"></p>\n<h1>4. Data consumption</h1>\n<p>Data consumption currently does not support direct consumption access to data, and data can be consumed normally after\nthe approval process.</p>\n<p>Click [New Consumption] to enter the data consumption process, and you need to fill in information related to\nconsumption.</p>\n<p><img src=\"img/image-1624432235900.png\" alt=\"\"></p>\n<h2>4.1 Consumer Information</h2>\n<p>Applicants need to gradually fill in the basic consumer business information related to data consumption applications in\nthe information filling module</p>\n<p><img src=\"img/image-1624432254118.png\" alt=\"\"></p>\n<ul>\n<li>Consumer group name: The prefix is automatically generated according to the product/project. The brief name of the\nconsumer must be composed of lowercase letters, numbers, and underscores. The final approval will assign the consumer\nname based on the abbreviation splicing</li>\n<li>Consumer Responsible Person: At least 2 persons are required to choose the responsible person; the responsible person\ncan view and modify the consumption information</li>\n<li>Consumer target business ID: you need to select the business ID of the consumer data, you can click [Query] and select\nthe appropriate business ID in the pop-up window\n<img src=\"img/image-1624432286674.png\" alt=\"\"></li>\n<li>Data usage: select data usage usage</li>\n<li>Data usage description: The applicant needs to briefly explain the items used and the purpose of the data according to\ntheir own consumption scenarios After completing the information, click [Submit], and the data consumption process\nwill be formally submitted to the approver before it will take effect.</li>\n</ul>\n<h1>5. Approval management</h1>\n<p>The approval management function module currently includes my application and my approval, and all tasks of data access\nand consumption application approval in the management system.</p>\n<h2>5.1 My application</h2>\n<p>Display the current task list submitted by the applicant for data access and consumption in the system, click [Details]\nto view the current basic information and approval process of the task.</p>\n<p><img src=\"img/image-1624432445002.png\" alt=\"\"></p>\n<h3>5.1.1 Data access details</h3>\n<p>Data access task detailed display The current basic information of the application task includes: applicant-related\ninformation, basic information about application access, and current approval process nodes.</p>\n<p><img src=\"img/image-1624432458971.png\" alt=\"\"></p>\n<h3>5.1.2 Data consumption details</h3>\n<p>Data consumption task details display basic information of current application tasks including: applicant information,\nbasic consumption information, and current approval process nodes.</p>\n<p><img src=\"img/image-1624432474526.png\" alt=\"\"></p>\n<h2>5.2 My approval</h2>\n<p>As a data access officer and system member with approval authority, have the responsibility for data access or\nconsumption approval.</p>\n<p><img src=\"img/image-1624432496461.png\" alt=\"\"></p>\n<h3>5.2.1 Data Access Approval</h3>\n<p>New data access approval: currently it is a first-level approval, which is approved by the system administrator.</p>\n<p>The system administrator will review whether the access process meets the access requirements based on the data access\nbusiness information.</p>\n<p><img src=\"img/image-1624432515850.png\" alt=\"\"></p>\n<h3>5.2.2 New data consumption approval</h3>\n<p>New data consume approval: currently it is a first-level approval, which is approved by the person in charge of the\nbusiness.</p>\n<p>Business approval: The person in charge of the data access business judges whether the consumption meets the business\nrequirements according to the access information:</p>\n<p><img src=\"img/image-1624432535541.png\" alt=\"\"></p>\n<h1>6. System Management</h1>\n<p>Only users with the role of system administrator can use this function. They can create, modify, and delete users:</p>\n<p><img src=\"img/image-1624432652141.png\" alt=\"\"></p>\n<h2>6.1 New user</h2>\n<p>Users with system administrator rights can create new user accounts</p>\n<p><img src=\"img/image-1624432668340.png\" alt=\"\"></p>\n<ul>\n<li>Account types: Ordinary users (with data access and data consumption permissions, but without data access approval and\naccount management permissions); system administrators (with data access and data consumption permissions, data access\napproval and account management permissions)</li>\n<li>username: username for login</li>\n<li>user password:\n-Effective duration: the account can be used in the system\n<img src=\"img/image-1624432740241.png\" alt=\"\"></li>\n</ul>\n<h2>6.2 Delete user</h2>\n<p>The system administrator can delete the account of the created user. After the deletion, the account will stop using:</p>\n<p><img src=\"img/image-1624432759224.png\" alt=\"\"></p>\n<h2>6.3 User Edit</h2>\n<p>The system administrator can modify the created account:</p>\n<p><img src=\"img/image-1624432778845.png\" alt=\"\"></p>\n<p>The system administrator can modify the account type and effective duration to proceed:</p>\n<p><img src=\"img/image-1624432797226.png\" alt=\"\"></p>\n<h2>6.4 Change password</h2>\n<p>The user can modify the account password, click [Modify Password], enter the old password and the new password, after\nconfirmation, the new password of this account will take effect:</p>\n<p><img src=\"img/image-1624432829313.png\" alt=\"\"></p>\n",
  "link": "/en-us/docs/cookbooks/user_manual.html",
  "meta": {}
}