{
  "filename": "tubemq_config_introduction.md",
  "__html": "<h1>TubeMQ configuration item description</h1>\n<p>The TubeMQ server includes two modules for the Master and the Broker. The Master also includes a Web front-end module for external page access (this part is stored in the resources). Considering the actual deployment, two modules are often deployed in the same machine, TubeMQ. The contents of the three parts of the two modules are packaged and delivered to the operation and maintenance; the client does not include the lib package of the server part and is delivered to the user separately.</p>\n<p>Master and Broker use the ini configuration file format, and the relevant configuration files are placed in the master.ini and broker.ini files in the tubemq-server-3.8.0/conf/ directory.</p>\n<p>Their configuration is defined by a set of configuration units. The Master configuration consists of four mandatory units: [master], [zookeeper], [bdbStore], and optional [tlsSetting]. The Broker configuration is mandatory. Broker], [zookeeper] and optional [tlsSetting] consist of a total of 3 configuration units; in actual use, you can also combine the contents of the two configuration files into one ini file.</p>\n<p>In addition to the back-end system configuration file, the Master also stores the Web front-end page module in the resources. The root directory velocity.properties file of the resources is the Web front-end page configuration file of the Master.</p>\n<h2>Configuration item details:</h2>\n<h3>master.ini file:</h3>\n<p>[master]</p>\n<blockquote>\n<p>Master system runs the main configuration unit, required unit, the value is fixed to &quot;[master]&quot;</p>\n</blockquote>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Required</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>hostName</td>\n<td>yes</td>\n<td>string</td>\n<td>The host address of the master external service, required, must be configured on the NIC, is enabled, non-loopback and cannot be IP of 127.0.0.1</td>\n</tr>\n<tr>\n<td>port</td>\n<td>no</td>\n<td>int</td>\n<td>Master listening port, optional, default is 8715</td>\n</tr>\n<tr>\n<td>webPort</td>\n<td>no</td>\n<td>int</td>\n<td>Master web console access port, the default value is 8080</td>\n</tr>\n<tr>\n<td>webResourcePath</td>\n<td>yes</td>\n<td>string</td>\n<td>Master Web Resource deploys an absolute path, which is required. If the value is set incorrectly, the web page will not display properly.</td>\n</tr>\n<tr>\n<td>confModAuthToken</td>\n<td>no</td>\n<td>string</td>\n<td>The authorization Token provided by the operator when the change operation (including adding, deleting, changing configuration, and changing the master and managed Broker status) is performed by the Master's Web or API. The value is optional. The default is &quot;ASDFGHJKL&quot;.</td>\n</tr>\n<tr>\n<td>firstBalanceDelayAfterStartMs</td>\n<td>no</td>\n<td>long</td>\n<td>Master starts to the interval of the first time to start Rebalance, optional, default 30000 milliseconds</td>\n</tr>\n<tr>\n<td>consumerBalancePeriodMs</td>\n<td>no</td>\n<td>long</td>\n<td>The master balances the rebalance period of the consumer group. The default is 60000 milliseconds. When the cluster size is large, increase the value.</td>\n</tr>\n<tr>\n<td>consumerHeartbeatTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>Consumer heartbeat timeout period, optional, default 30000 milliseconds, when the cluster size is large, please increase the value</td>\n</tr>\n<tr>\n<td>producerHeartbeatTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>Producer heartbeat timeout period, optional, default 30000 milliseconds, when the cluster size is large, please increase the value</td>\n</tr>\n<tr>\n<td>brokerHeartbeatTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>Broker heartbeat timeout period, optional, default 30000 milliseconds, when the cluster size is large, please increase the value</td>\n</tr>\n<tr>\n<td>socketRecvBuffer</td>\n<td>no</td>\n<td>long</td>\n<td>Socket receives the size of the Buffer buffer SO_RCVBUF, the unit byte, the negative number is set as the default value</td>\n</tr>\n<tr>\n<td>socketSendBuffer</td>\n<td>no</td>\n<td>long</td>\n<td>Socket sends Buffer buffer SO_SNDBUF size, unit byte, negative number is  set as the default value</td>\n</tr>\n<tr>\n<td>maxAutoForbiddenCnt</td>\n<td>no</td>\n<td>int</td>\n<td>When the broker has an IO failure, the maximum number of masters allowed to automatically go offline is the number of options. The default value is 5. It is recommended that the value does not exceed 10% of the total number of brokers in the cluster.</td>\n</tr>\n<tr>\n<td>startOffsetResetCheck</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable the check function of the client Offset reset function, optional, the default is false</td>\n</tr>\n<tr>\n<td>needBrokerVisitAuth</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable Broker access authentication, the default is false. If true, the message reported by the broker must carry the correct username and signature information.</td>\n</tr>\n<tr>\n<td>visitName</td>\n<td>no</td>\n<td>string</td>\n<td>The username of the Broker access authentication. The default is an empty string. This value must exist when needBrokerVisitAuth is true. This value must be the same as the value of the visitName field in broker.ini.</td>\n</tr>\n<tr>\n<td>visitPassword</td>\n<td>no</td>\n<td>string</td>\n<td>The password for the Broker access authentication. The default is an empty string. This value must exist when needBrokerVisitAuth is true. This value must be the same as the value of the visitPassword field in broker.ini.</td>\n</tr>\n<tr>\n<td>startVisitTokenCheck</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable client visitToken check, the default is false</td>\n</tr>\n<tr>\n<td>startProduceAuthenticate</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable production end user authentication, the default is false</td>\n</tr>\n<tr>\n<td>startProduceAuthorize</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable production-side production authorization authentication, the default is false</td>\n</tr>\n<tr>\n<td>startConsumeAuthenticate</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable consumer user authentication, the default is false</td>\n</tr>\n<tr>\n<td>startConsumeAuthorize</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable consumer consumption authorization authentication, the default is false</td>\n</tr>\n<tr>\n<td>maxGroupBrokerConsumeRate</td>\n<td>no</td>\n<td>int</td>\n<td>The maximum ratio of the number of clustered brokers to the number of members in the consumer group. The default is 50. In a 50-kerrow cluster, one consumer group is allowed to start at least one client.</td>\n</tr>\n</tbody>\n</table>\n<p>[zookeeper]</p>\n<blockquote>\n<p>The corresponding Tom MQ cluster of the Master stores the information about the ZooKeeper cluster of the Offset. The required unit has a fixed value of &quot;[zookeeper]&quot;.</p>\n</blockquote>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Required</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>zkServerAddr</td>\n<td>no</td>\n<td>string</td>\n<td>Zk server address, optional configuration, defaults to &quot;localhost:2181&quot;</td>\n</tr>\n<tr>\n<td>zkNodeRoot</td>\n<td>no</td>\n<td>string</td>\n<td>The root path of the node on zk, optional configuration. The default is &quot;/tube&quot;.</td>\n</tr>\n<tr>\n<td>zkSessionTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>Zk heartbeat timeout, in milliseconds, default 30 seconds</td>\n</tr>\n<tr>\n<td>zkConnectionTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>Zk connection timeout, in milliseconds, default 30 seconds</td>\n</tr>\n<tr>\n<td>zkSyncTimeMs</td>\n<td>no</td>\n<td>long</td>\n<td>Zk data synchronization time, in milliseconds, default 5 seconds</td>\n</tr>\n<tr>\n<td>zkCommitPeriodMs</td>\n<td>no</td>\n<td>long</td>\n<td>The interval at which the Master cache data is flushed to zk, in milliseconds, default 5 seconds.</td>\n</tr>\n</tbody>\n</table>\n<p>[bdbStore]</p>\n<blockquote>\n<p>Master configuration of the BDB cluster to which the master belongs. The master uses BDB for metadata storage and multi-node hot standby. The required unit has a fixed value of &quot;[bdbStore]&quot;.</p>\n</blockquote>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Required</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>bdbRepGroupName</td>\n<td>yes</td>\n<td>string</td>\n<td>BDB cluster name, the primary and backup master node values must be the same, required field</td>\n</tr>\n<tr>\n<td>bdbNodeName</td>\n<td>yes</td>\n<td>string</td>\n<td>The name of the node of the master in the BDB cluster. The value of each BDB node must not be repeated. Required field.</td>\n</tr>\n<tr>\n<td>bdbNodePort</td>\n<td>no</td>\n<td>int</td>\n<td>BDB node communication port, optional field, default is 9001</td>\n</tr>\n<tr>\n<td>bdbEnvHome</td>\n<td>yes</td>\n<td>string</td>\n<td>BDB data storage path, required field</td>\n</tr>\n<tr>\n<td>bdbHelperHost</td>\n<td>yes</td>\n<td>string</td>\n<td>Primary node when the BDB cluster starts, required field</td>\n</tr>\n<tr>\n<td>bdbLocalSync</td>\n<td>no</td>\n<td>int</td>\n<td>BDB data node local storage mode, the value range of this field is [1, 2, 3]. The default is 1: 1 is data saved to disk, 2 is data only saved to memory, and 3 is only data is written to file system buffer. But not brush</td>\n</tr>\n<tr>\n<td>bdbReplicaSync</td>\n<td>no</td>\n<td>int</td>\n<td>BDB data node synchronization save mode, the value range of this field is [1, 2, 3]. The default is 1: 1 is data saved to disk, 2 is data only saved to memory, and 3 is only data is written to file system buffer. But not brush</td>\n</tr>\n<tr>\n<td>bdbReplicaAck</td>\n<td>no</td>\n<td>int</td>\n<td>The response policy of the BDB node data synchronization, the value range of this field is [1, 2, 3], the default is 1: 1 is more than 1/2 majority is valid, 2 is valid for all nodes, 3 is not Need node response</td>\n</tr>\n<tr>\n<td>bdbStatusCheckTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>BDB status check interval, optional field, in milliseconds, defaults to 10 seconds</td>\n</tr>\n</tbody>\n</table>\n<p>[tlsSetting]</p>\n<blockquote>\n<p>The Master uses TLS to encrypt the transport layer data. When TLS is enabled, the configuration unit provides related settings. The optional unit has a fixed value of &quot;[tlsSetting]&quot;.</p>\n</blockquote>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Required</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>tlsEnable</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable TLS function, optional configuration, default is false</td>\n</tr>\n<tr>\n<td>tlsPort</td>\n<td>no</td>\n<td>int</td>\n<td>Master TLS port number, optional configuration, default is 8716</td>\n</tr>\n<tr>\n<td>tlsKeyStorePath</td>\n<td>no</td>\n<td>string</td>\n<td>The absolute storage path of the TLS keyStore file + the name of the keyStore file. This field is required and cannot be empty when the TLS function is enabled.</td>\n</tr>\n<tr>\n<td>tlsKeyStorePassword</td>\n<td>no</td>\n<td>string</td>\n<td>The absolute storage path of the TLS keyStorePassword file + the name of the keyStorePassword file. This field is required and cannot be empty when the TLS function is enabled.</td>\n</tr>\n<tr>\n<td>tlsTwoWayAuthEnable</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable TLS mutual authentication, optional configuration, the default is false</td>\n</tr>\n<tr>\n<td>tlsTrustStorePath</td>\n<td>no</td>\n<td>string</td>\n<td>The absolute storage path of the TLS TrustStore file + the TrustStore file name. This field is required and cannot be empty when the TLS function is enabled and mutual authentication is enabled.</td>\n</tr>\n<tr>\n<td>tlsTrustStorePassword</td>\n<td>no</td>\n<td>string</td>\n<td>The absolute storage path of the TLS TrustStorePassword file + the TrustStorePassword file name. This field is required and cannot be empty when the TLS function is enabled and mutual authentication is enabled.</td>\n</tr>\n</tbody>\n</table>\n<h3>velocity.properties file:</h3>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Required</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>file.resource.loader.path</td>\n<td>yes</td>\n<td>string</td>\n<td>The absolute path of the master web template. This part is the absolute path plus /resources/templates of the project when the master is deployed. The configuration is consistent with the actual deployment. If the configuration fails, the master front page access fails.</td>\n</tr>\n</tbody>\n</table>\n<h3>broker.ini file:</h3>\n<p>[broker]</p>\n<blockquote>\n<p>The broker system runs the main configuration unit, required unit, and the value is fixed to &quot;[broker]&quot;</p>\n</blockquote>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Required</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>brokerId</td>\n<td>yes</td>\n<td>int</td>\n<td>Server unique flag, required field, can be set to 0; when set to 0, the system will default to take the local IP to int value</td>\n</tr>\n<tr>\n<td>hostName</td>\n<td>yes</td>\n<td>string</td>\n<td>The host address of the broker external service, required, must be configured in the NIC, is enabled, non-loopback and cannot be IP of 127.0.0.1</td>\n</tr>\n<tr>\n<td>port</td>\n<td>no</td>\n<td>int</td>\n<td>Broker listening port, optional, default is 8123</td>\n</tr>\n<tr>\n<td>webPort</td>\n<td>no</td>\n<td>int</td>\n<td>Broker's http management access port, optional, default is 8081</td>\n</tr>\n<tr>\n<td>masterAddressList</td>\n<td>yes</td>\n<td>string</td>\n<td>Master address list of the cluster to which the broker belongs. Required fields. The format must be ip1:port1, ip2:port2, ip3:port3.</td>\n</tr>\n<tr>\n<td>primaryPath</td>\n<td>yes</td>\n<td>string</td>\n<td>Broker stores the absolute path of the message, mandatory field</td>\n</tr>\n<tr>\n<td>maxSegmentSize</td>\n<td>no</td>\n<td>int</td>\n<td>Broker stores the file size of the message data content, optional field, default 512M, maximum 1G</td>\n</tr>\n<tr>\n<td>maxIndexSegmentSize</td>\n<td>no</td>\n<td>int</td>\n<td>Broker stores the file size of the message Index content, optional field, default 18M, about 70W messages per file</td>\n</tr>\n<tr>\n<td>transferSize</td>\n<td>no</td>\n<td>int</td>\n<td>Broker allows the maximum message content size to be transmitted to the client each time, optional field, default is 512K</td>\n</tr>\n<tr>\n<td>consumerRegTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>Consumer heartbeat timeout, optional, in milliseconds, default 30 seconds</td>\n</tr>\n<tr>\n<td>socketRecvBuffer</td>\n<td>no</td>\n<td>long</td>\n<td>Socket receives the size of the Buffer buffer SO_RCVBUF, the unit byte, the negative number is not set, the default value is</td>\n</tr>\n<tr>\n<td>socketSendBuffer</td>\n<td>no</td>\n<td>long</td>\n<td>Socket sends Buffer buffer SO_SNDBUF size, unit byte, negative number is not set, the default value is</td>\n</tr>\n<tr>\n<td>secondDataPath</td>\n<td>no</td>\n<td>string</td>\n<td>The SSD to storage location where the broker is located, optional field. The default is blank to indicate that the machine has no SSD.</td>\n</tr>\n<tr>\n<td>maxSSDTotalFileCnt</td>\n<td>no</td>\n<td>int</td>\n<td>The maximum number of Data files allowed by the SSD where the Broker is located, optional field, default 70</td>\n</tr>\n<tr>\n<td>maxSSDTotalFileSizes</td>\n<td>no</td>\n<td>long</td>\n<td>The SSD where the Broker is located allows the maximum size of the data file to be saved. The optional field is 32G by default.</td>\n</tr>\n<tr>\n<td>tcpWriteServiceThread</td>\n<td>no</td>\n<td>int</td>\n<td>Broker supports the number of socket worker threads for TCP production services, optional fields, and defaults to 2 times the number of CPUs of the machine.</td>\n</tr>\n<tr>\n<td>tcpReadServiceThread</td>\n<td>no</td>\n<td>int</td>\n<td>Broker supports the number of socket worker threads for TCP consumer services, optional fields, defaults to 2 times the number of CPUs of the machine</td>\n</tr>\n<tr>\n<td>logClearupDurationMs</td>\n<td>no</td>\n<td>long</td>\n<td>The aging cleanup period of the message file, in milliseconds. The default is 30 minutes for a log cleanup operation. The minimum is 30 minutes.</td>\n</tr>\n<tr>\n<td>logFlushDiskDurMs</td>\n<td>no</td>\n<td>long</td>\n<td>Batch check message persistence to file check cycle, in milliseconds, default is 20 seconds for a full check and brush</td>\n</tr>\n<tr>\n<td>visitTokenCheckInValidTimeMs</td>\n<td>no</td>\n<td>long</td>\n<td>The length of the delay check for the visitToken check since the Broker is registered, in ms, the default is 120000, the value range [60000, 300000].</td>\n</tr>\n<tr>\n<td>visitMasterAuth</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether the authentication of the master is enabled, the default is false. If true, the user name and signature information are added to the signaling reported to the master.</td>\n</tr>\n<tr>\n<td>visitName</td>\n<td>no</td>\n<td>string</td>\n<td>User name of the access master. The default is an empty string. This value must exist when visitMasterAuth is true. The value must be the same as the value of the visitName field in master.ini.</td>\n</tr>\n<tr>\n<td>visitPassword</td>\n<td>no</td>\n<td>string</td>\n<td>The password for accessing the master. The default is an empty string. This value must exist when visitMasterAuth is true. The value must be the same as the value of the visitPassword field in master.ini.</td>\n</tr>\n<tr>\n<td>logFlushMemDurMs</td>\n<td>no</td>\n<td>long</td>\n<td>Batch check message memory persistence to file check cycle, in milliseconds, default is 10 seconds for a full check and brush</td>\n</tr>\n</tbody>\n</table>\n<p>[zookeeper]</p>\n<blockquote>\n<p>The Tube MQ cluster corresponding to the Broker stores the information about the ZooKeeper cluster of the Offset. The required unit has a fixed value of &quot;[zookeeper]&quot;.</p>\n</blockquote>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Required</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>zkServerAddr</td>\n<td>no</td>\n<td>string</td>\n<td>Zk server address, optional configuration, defaults to &quot;localhost:2181&quot;</td>\n</tr>\n<tr>\n<td>zkNodeRoot</td>\n<td>no</td>\n<td>string</td>\n<td>The root path of the node on zk, optional configuration. The default is &quot;/tube&quot;.</td>\n</tr>\n<tr>\n<td>zkSessionTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>Zk heartbeat timeout, in milliseconds, default 30 seconds</td>\n</tr>\n<tr>\n<td>zkConnectionTimeoutMs</td>\n<td>no</td>\n<td>long</td>\n<td>Zk connection timeout, in milliseconds, default 30 seconds</td>\n</tr>\n<tr>\n<td>zkSyncTimeMs</td>\n<td>no</td>\n<td>long</td>\n<td>Zk data synchronization time, in milliseconds, default 5 seconds</td>\n</tr>\n<tr>\n<td>zkCommitPeriodMs</td>\n<td>no</td>\n<td>long</td>\n<td>The interval at which the broker cache data is flushed to zk, in milliseconds, default 5 seconds</td>\n</tr>\n<tr>\n<td>zkCommitFailRetries</td>\n<td>no</td>\n<td>int</td>\n<td>The maximum number of re-brushings after Broker fails to flush cached data to Zk</td>\n</tr>\n</tbody>\n</table>\n<p>[tlsSetting]</p>\n<blockquote>\n<p>The Master uses TLS to encrypt the transport layer data. When TLS is enabled, the configuration unit provides related settings. The optional unit has a fixed value of &quot;[tlsSetting]&quot;.</p>\n</blockquote>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Required</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>tlsEnable</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable TLS function, optional configuration, default is false</td>\n</tr>\n<tr>\n<td>tlsPort</td>\n<td>no</td>\n<td>int</td>\n<td>Broker TLS port number, optional configuration, default is 8124</td>\n</tr>\n<tr>\n<td>tlsKeyStorePath</td>\n<td>no</td>\n<td>string</td>\n<td>The absolute storage path of the TLS keyStore file + the name of the keyStore file. This field is required and cannot be empty when the TLS function is enabled.</td>\n</tr>\n<tr>\n<td>tlsKeyStorePassword</td>\n<td>no</td>\n<td>string</td>\n<td>The absolute storage path of the TLS keyStorePassword file + the name of the keyStorePassword file. This field is required and cannot be empty when the TLS function is enabled.</td>\n</tr>\n<tr>\n<td>tlsTwoWayAuthEnable</td>\n<td>no</td>\n<td>boolean</td>\n<td>Whether to enable TLS mutual authentication, optional configuration, the default is false</td>\n</tr>\n<tr>\n<td>tlsTrustStorePath</td>\n<td>no</td>\n<td>string</td>\n<td>The absolute storage path of the TLS TrustStore file + the TrustStore file name. This field is required and cannot be empty when the TLS function is enabled and mutual authentication is enabled.</td>\n</tr>\n<tr>\n<td>tlsTrustStorePassword</td>\n<td>no</td>\n<td>string</td>\n<td>The absolute storage path of the TLS TrustStorePassword file + the TrustStorePassword file name. This field is required and cannot be empty when the TLS function is enabled and mutual authentication is enabled.</td>\n</tr>\n</tbody>\n</table>\n<hr>\n<p><a href=\"#top\">Back to top</a></p>\n",
  "link": "/zh-cn/docs/tubemq_config_introduction.html",
  "meta": {}
}