{
  "filename": "contribution.md",
  "__html": "<p>The Apache TubeMQ(incubating) community welcomes contributions from anyone with a passion for distributed systems! TubeMQ has many different opportunities for contributions -- write new examples/tutorials, add new user-facing libraries or participate on the documentation effort.</p>\n<p>We use a review-then-commit workflow in TubeMQ for all contributions.</p>\n<p><strong>For larger contributions or those that affect multiple components:</strong></p>\n<ol>\n<li><strong>Engage</strong>: We encourage you to work with the TubeMQ community on the <a href=\"https://jira.apache.org/jira/browse/TUBEMQ\">JIRA</a> and <a href=\"/contact\">developer’s mailing list</a> to identify good areas for contribution.</li>\n<li><strong>Design:</strong> More complicated contributions will likely benefit from some early discussion in order to scope and design them well.</li>\n</ol>\n<p><strong>For all contributions:</strong></p>\n<ol>\n<li><strong>Code:</strong> The you-know-what part.</li>\n<li><strong>Review:</strong> Submit a pull request with your contribution to our <a href=\"https://github.com/apache/incubator-tubemq\">GitHub Repo</a>. Work with a committer to review and iterate on the code, if needed.</li>\n<li><strong>Commit:</strong> Once at least 1 TubeMQ committer has approved the pull request, a TubeMQ committer will merge it into the master branch (and potentially backport to stable branches in case of bug fixes).</li>\n</ol>\n<p>We look forward to working with you!</p>\n<h2>Engage</h2>\n<h3>Mailing list(s)</h3>\n<p>We discuss design and implementation issues on the <a href=\"mailto:dev@tubemq.apache.org\">dev@tubemq.apache.org</a> mailing list, which is archived <a href=\"https://lists.apache.org/list.html?dev@tubemq.apache.org\">here</a>. Join by emailing <a href=\"mailto:dev-subscribe@tubemq.apache.org\"><code>dev-subscribe@tubemq.apache.org</code></a>.</p>\n<h3>JIRA</h3>\n<p>We are using <a href=\"https://jira.apache.org/jira/browse/TUBEMQ\">JIRA</a> as the issue tracking\nand project management tool, as well as a way to communicate among a very diverse and distributed set of contributors. To be able to gather feedback, avoid frustration, and avoid duplicated efforts all TubeMQ related work are being tracked there.</p>\n<p>If you do not already have an JIRA account, sign up <a href=\"https://jira.apache.org/jira/secure/Signup!default.jspa\">here</a>.</p>\n<p>If a quick <a href=\"https://jira.apache.org/jira/projects/TUBEMQ/issues\">search</a> doesn’t turn up an existing JIRA issue for the work you want to contribute, create it. Please discuss your idea with a committer in JIRA or, alternatively, on the developer mailing list.</p>\n<p>If there’s an existing JIRA issue for your intended contribution, please comment about your intended work. Once the work is understood, a committer will assign the issue to you. If an issue is currently assigned, please check with the current assignee before reassigning.</p>\n<p>For moderate or large contributions, you should not start coding or writing a design document unless there is a corresponding JIRA issue assigned to you for that work. Any change requires an associated JIRA issue.</p>\n<h2>Design</h2>\n<p>To avoid potential frustration during the code review cycle, we encourage you to clearly scope and design non-trivial contributions with the TubeMQ community before you start coding.</p>\n<p>We are using &quot;TubeMQ Improvement Proposals&quot; for managing major changes to TubeMQ. The list of all proposals is maintained in the TubeMQ wiki at <a href=\"https://cwiki.apache.org/confluence/display/TUBEMQ/TubeMQ+Improvement+Proposals\">this page</a>.</p>\n<h2>Commit (committers only)</h2>\n<p>Once the code has been peer reviewed by a committer, the next step is for the committer to merge it into the Github repo.</p>\n<p>Pull requests should not be merged before the review has approved from at least 1 committer.</p>\n<p>For more about merging pull request, please refer to <a href=\"https://cwiki.apache.org/confluence/display/TUBEMQ/Merging+Pull+Requests\">this page</a></p>\n<h2>Website Contributor List</h2>\n<p>We are very pleased to announce some contributors here. They have made a lot of contributions in the translation of TubeMQ. Thanks again to the following participants.</p>\n<ul>\n<li>deepEvolution</li>\n<li>missy</li>\n<li>min.yang</li>\n<li>goson</li>\n<li>stillcoolme</li>\n<li>tboy</li>\n<li>viviel</li>\n<li>yuecai.liu</li>\n</ul>\n",
  "link": "/en-us/docs/contribution.html",
  "meta": {}
}