{
  "filename": "quick_start.md",
  "__html": "<p>This section contains a quick start guide to help you get started with Apache InLong.</p>\n<h1>Overall architecture</h1>\n<img src=\"../../img/inlong_architecture.png\" align=\"center\" alt=\"Apache InLong\"/>\n<p><a href=\"https://inlong.apache.org\">Apache InLong</a>(incubating) overall architecture is as above. This component is a one-stop data streaming platform that provides automated, secure, distributed, and efficient data publishing and subscription capabilities to help You can easily build stream-based data applications.</p>\n<p>InLong (Yinglong) was originally built in Tencent and has served online business for more than 8 years. It supports massive data (over 40 trillion pieces of data per day) report services under big data scenarios. The entire platform integrates 5 modules including data collection, aggregation, caching, sorting and management modules. Through this system, the business only needs to provide data sources, data service quality, data landing clusters and data landing formats, that is, data can be continuous Push data from the source cluster to the target cluster, which greatly meets the data reporting service requirements in the business big data scenario.</p>\n<h1>How to use</h1>\n<p>Through the overall architecture diagram of InLong above, we can see that InLong contains complete data reporting components, and we need to compile and deploy modules one by one.</p>\n<h2>Compile and deploy Manager</h2>\n<p><a href=\"modules/manager/quick_start.md\">How to compile and deploy Manager</a></p>\n<h2>Compile and deploy InLong Web</h2>\n<p><a href=\"modules/console/quick_start.md\">How to compile and deploy InLong Web</a></p>\n<h2>Compile and deploy TubeMQ</h2>\n<p><a href=\"modules/tubemq/quick_start.md\">How to compile and deploy TubeMQ</a></p>\n<h2>Compile and deploy TubeMQ Manager</h2>\n<p><a href=\"modules/tubemq/tubemq-manager/quick_start.md\">How to compile and deploy TubeMQ Manager</a></p>\n<h2>Compile and deploy Sort</h2>\n<p><a href=\"modules/sort/quick_start.md\">How to compile and deploy Sort</a></p>\n<h2>Compile and deploy DataProxy</h2>\n<p><a href=\"modules/dataproxy/quick_start.md\">How to compile and deploy DataProxy</a></p>\n<h2>Compile and deploy the Agent</h2>\n<p><a href=\"modules/agent/quick_start.md\">How to compile and deploy Agent</a></p>\n<h2>Business configuration</h2>\n<p><a href=\"modules/manager/user_manual.md\">How to configure a new business</a></p>\n<h2>Data report verification</h2>\n<p>At this stage, you can collect data through the file agent and verify whether the received data is consistent with the sent data in the specified Hive table.</p>\n",
  "link": "/en-us/docs/quick_start.html",
  "meta": {
    "title": "Getting Started - Apache InLong"
  }
}